src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ТипЦена</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦенНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/РаботаСДокументамиСервер/Module.bsl
Функция ПолучитьЦену(Дата, ВидЦены, МассивНоменклатуры)Экспорт
	РегистрМетаданные = Метаданные.РегистрыСведений.ЦеныНоменклатуры;
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений();
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", РегистрМетаданные.Измерения.Номенклатура.Тип);
	ТаблицаНоменклатуры.Колонки.Добавить("ВидЦены", РегистрМетаданные.Измерения.ВидЦены.Тип);
	
	Для Каждого Номенклатура Из МассивНоменклатуры Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.ВидЦены = ВидЦены;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|				(Номенклатура, ВидЦены) В
	|					(ВЫБРАТЬ
	|						ТаблицаНоменклатуры.Номенклатура,
	|						ТаблицаНоменклатуры.ВидЦены
	|					ИЗ
	|						ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)) КАК Цены
	|		ПО ТаблицаНоменклатуры.Номенклатура = Цены.Номенклатура
	|			И ТаблицаНоменклатуры.ВидЦены = Цены.ВидЦены";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Результат = Новый Массив();
	Для Каждого Строка Из ТаблицаЗапроса Цикл
		НоваяСтрока = Новый Структура("Номенклатура, Цена");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Результат.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат Результат;		
		
КонецФункции
